#Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#[2, 3, 4, 5, 6] => [12, 15, 16];
#[2, 3, 5, 6] => [12, 15]
N = [2,3,5,6]
a = []
mult = 1
for i in range(len(N)//2):
    mult = N[i]*N[-i-1]
    a.append(mult)
print(a)
 
